Data/Section 5/5.2/Client/VM1_Instance1/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       45506 ops,     495 (avg:     505) ops/sec, 1.76MB/sec (avg: 1.80MB/sec),  4.03 (avg:  3.94) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         252.80          ---          ---      3.87800       262.53
Gets         252.80      1516.83         0.00      4.00300      1578.23
Waits          0.00          ---          ---      0.00000          ---
Totals       505.61      1516.83         0.00      3.94000      1840.76


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.300         0.00
SET       1.400         0.11
SET       1.500         0.49
SET       1.600         1.71
SET       1.700         4.20
SET       1.800         8.06
SET       1.900        12.74
SET       2.000        18.00
SET       2.100        23.13
SET       2.200        27.82
SET       2.300        32.03
SET       2.400        35.75
SET       2.500        39.11
SET       2.600        41.98
SET       2.700        44.53
SET       2.800        46.79
SET       2.900        48.78
SET       3.000        50.51
SET       3.100        52.27
SET       3.200        53.78
SET       3.300        55.11
SET       3.400        56.34
SET       3.500        57.45
SET       3.600        58.50
SET       3.700        59.41
SET       3.800        60.49
SET       3.900        61.63
SET       4.000        62.64
SET       4.100        63.70
SET       4.200        64.77
SET       4.300        65.87
SET       4.400        66.89
SET       4.500        68.14
SET       4.600        69.45
SET       4.700        70.69
SET       4.800        72.07
SET       4.900        73.35
SET       5.000        74.56
SET       5.100        76.03
SET       5.200        77.36
SET       5.300        78.77
SET       5.400        80.01
SET       5.500        81.31
SET       5.600        82.52
SET       5.700        83.64
SET       5.800        84.78
SET       5.900        85.95
SET       6.000        86.92
SET       6.100        87.88
SET       6.200        88.66
SET       6.300        89.45
SET       6.400        90.12
SET       6.500        90.66
SET       6.600        91.28
SET       6.700        91.81
SET       6.800        92.33
SET       6.900        92.83
SET       7.000        93.21
SET       7.100        93.58
SET       7.200        93.87
SET       7.300        94.09
SET       7.400        94.31
SET       7.500        94.57
SET       7.600        94.79
SET       7.700        95.01
SET       7.800        95.23
SET       7.900        95.42
SET       8.000        95.63
SET       8.100        95.76
SET       8.200        95.89
SET       8.300        96.08
SET       8.400        96.23
SET       8.500        96.35
SET       8.600        96.50
SET       8.700        96.63
SET       8.800        96.76
SET       8.900        96.90
SET       9.000        97.04
SET       9.100        97.17
SET       9.200        97.31
SET       9.300        97.42
SET       9.400        97.57
SET       9.500        97.65
SET       9.600        97.75
SET       9.700        97.84
SET       9.800        97.95
SET       9.900        98.03
SET      10.000        98.44
SET      11.000        98.88
SET      12.000        99.09
SET      13.000        99.24
SET      14.000        99.38
SET      15.000        99.48
SET      16.000        99.61
SET      17.000        99.68
SET      18.000        99.74
SET      19.000        99.81
SET      20.000        99.84
SET      21.000        99.86
SET      22.000        99.87
SET      23.000        99.89
SET      24.000        99.90
SET      25.000        99.91
SET      26.000        99.92
SET      28.000        99.92
SET      29.000        99.93
SET      32.000        99.93
SET      33.000        99.93
SET      34.000        99.94
SET      35.000        99.95
SET      36.000        99.95
SET      37.000        99.96
SET      39.000        99.96
SET      43.000        99.96
SET      45.000        99.97
SET      51.000        99.97
SET      58.000        99.98
SET      63.000        99.98
SET      71.000        99.99
SET      91.000        99.99
SET      92.000       100.00
SET     150.000       100.00
---
GET       1.500         0.01
GET       1.600         0.12
GET       1.700         0.80
GET       1.800         2.57
GET       1.900         5.78
GET       2.000        10.22
GET       2.100        15.67
GET       2.200        21.16
GET       2.300        26.82
GET       2.400        32.01
GET       2.500        36.22
GET       2.600        40.12
GET       2.700        43.58
GET       2.800        46.61
GET       2.900        48.93
GET       3.000        51.29
GET       3.100        53.38
GET       3.200        55.02
GET       3.300        56.35
GET       3.400        57.65
GET       3.500        58.90
GET       3.600        59.93
GET       3.700        60.92
GET       3.800        61.87
GET       3.900        62.78
GET       4.000        63.61
GET       4.100        64.46
GET       4.200        65.33
GET       4.300        66.15
GET       4.400        67.00
GET       4.500        67.96
GET       4.600        68.87
GET       4.700        69.85
GET       4.800        70.96
GET       4.900        72.13
GET       5.000        73.45
GET       5.100        74.64
GET       5.200        75.88
GET       5.300        77.09
GET       5.400        78.43
GET       5.500        79.84
GET       5.600        81.08
GET       5.700        82.49
GET       5.800        83.70
GET       5.900        84.93
GET       6.000        86.19
GET       6.100        87.34
GET       6.200        88.41
GET       6.300        89.36
GET       6.400        90.24
GET       6.500        91.08
GET       6.600        91.69
GET       6.700        92.36
GET       6.800        92.92
GET       6.900        93.33
GET       7.000        93.75
GET       7.100        94.12
GET       7.200        94.44
GET       7.300        94.74
GET       7.400        95.00
GET       7.500        95.26
GET       7.600        95.54
GET       7.700        95.73
GET       7.800        95.91
GET       7.900        96.06
GET       8.000        96.27
GET       8.100        96.46
GET       8.200        96.62
GET       8.300        96.73
GET       8.400        96.85
GET       8.500        96.94
GET       8.600        97.03
GET       8.700        97.12
GET       8.800        97.21
GET       8.900        97.32
GET       9.000        97.43
GET       9.100        97.50
GET       9.200        97.56
GET       9.300        97.64
GET       9.400        97.75
GET       9.500        97.84
GET       9.600        97.97
GET       9.700        98.05
GET       9.800        98.12
GET       9.900        98.18
GET      10.000        98.45
GET      11.000        98.92
GET      12.000        99.16
GET      13.000        99.35
GET      14.000        99.44
GET      15.000        99.53
GET      16.000        99.57
GET      17.000        99.64
GET      18.000        99.67
GET      19.000        99.69
GET      20.000        99.71
GET      21.000        99.77
GET      22.000        99.79
GET      23.000        99.80
GET      24.000        99.81
GET      25.000        99.82
GET      26.000        99.82
GET      27.000        99.82
GET      28.000        99.83
GET      29.000        99.84
GET      31.000        99.85
GET      32.000        99.85
GET      33.000        99.86
GET      35.000        99.88
GET      36.000        99.88
GET      37.000        99.89
GET      40.000        99.89
GET      41.000        99.90
GET      42.000        99.91
GET      55.000        99.92
GET      63.000        99.92
GET      68.000        99.93
GET      69.000        99.93
GET      84.000        99.93
GET      86.000        99.94
GET      88.000        99.95
GET      89.000        99.96
GET      91.000        99.96
GET      95.000        99.97
GET     100.000        99.98
GET     150.000        99.98
GET     160.000        99.99
GET     170.000        99.99
GET     450.000       100.00
---